{
  "courses": [
    {
      "courseNumber": "CMPSC 201",
      "courseName": "Programming Languages",
      "Major": [
        "Software Engineering Major"
      ],
      "Minor": [
        "Software Engineering Minor"
      ],
      "credits": "4",
      "distributionRequirements": [
        "QR",
        "SP"
      ],
      "prerequisites": {
        "anyof": [
          "CMPSC 101",
          "CMPSC 102"
        ],
        "allof": []
      },
      "unlocks": [
        "CMPSC 400",
        "CMPSC 403"
      ],
      "courseDescription": "A study of the fundamental concepts that arise in different programming language paradigms. Students learn how programming languages are designed and implemented, and how these factors affect the overall usability, performance, and effectiveness of computer software. Participating in hands-on activities that often require teamwork, students gain experience in leveraging the styles and features of programming languages to implement and evaluate correct and efficient computer software. During a weekly laboratory session, students use state-of-the-art technology to complete projects, reporting on their results through both written documents and oral presentations. Students are invited to use their own departmentally approved laptop in this course; a limited number of laptops are available for use during class and lab sessions.",
      "cslevel": "",
      "dslevel": "",
      "dsSub": "",
      "inflevel": "",
      "infSub": "",
      "selevel": "Core",
      "technicalTopics": [
        "Language Design",
        "Control Flow",
        "Functional programming",
        "Compiler vs Interpreter",
        "Functions",
        "Logic Programming",
        "Grammars & Scanning",
        "OOP",
        "Security",
        "Parsing",
        "Classes",
        "Typing"
      ],
      "professionalTopics": [
        "teamwork",
        "code review",
        "communication"
      ],
      "tools": [
        "Bash",
        "Docker",
        "Java",
        "C",
        "Git",
        "Java Bytecode",
        "C sharp",
        "GitHub",
        "JavaScript",
        "C++",
        "Haskell",
        "Prolog"
      ],
      "platform": [
        "https://github.com/CMPSC-201-Spring2023"
      ],
      "learningObjectives": [
        "Understand fundamental concepts that underlie programming language syntax and semantics",
        "Gain exposure to many different languages",
        "Learn how to use language constructs effectively to design correct and elegant programs",
        "Continue developing team-working strategies",
        "Enhance ability to write and present ideas about software in a clear, concise, and compelling fashion"
      ],
      "learningOutcomes": [
        "Can proficiently program in languages such as Java",
        "Able to design a grammar for a language.",
        "Be able to learn new programming languages with a minimum of effort based on an understanding of general principles of language design and implementation."
      ]
    },
    {
      "courseNumber": "CMPSC 303",
      "courseName": "Artificial Intelligence",
      "Major": [
        "Data Science Major",
        "Software Engineering Major"
      ],
      "Minor": [
        "Software Engineering Minor"
      ],
      "credits": "4",
      "distributionRequirements": [
        "QR",
        "SP"
      ],
      "prerequisites": {
        "anyof": [
          "CMPSC 101",
          "CMPSC 102"
        ],
        "allof": []
      },
      "unlocks": [],
      "courseDescription": "A study of the design and implementation of intelligent computer systems that can learn, plan, and solve problems autonomously. In addition to examining techniques for designing intelligent software agents, students investigate the social, political, and ethical implications of intelligent systems. Through hands-on activities that often require team-work, students explore the application of artificial intelligence methods in areas such as computer vision, natural language processing, and video game development. During a weekly laboratory session students use industry-grade technology to complete projects, reporting on their results through both written documents and oral presentations. Students are invited to use their own departmentally approved laptop in this course; a limited number of laptops are available for use during class and lab sessions.",
      "cslevel": "",
      "dslevel": "Electives",
      "dsSub": "",
      "inflevel": "",
      "infSub": "",
      "selevel": "Electives",
      "technicalTopics": [
        "Agents",
        "Search Algorithms in AI",
        "Learning Overview",
        "Supervised Learning",
        "Computer Vision",
        "Natural Language Processing",
        "Bayes Theory",
        "Neural Networks",
        "Attention Mechanisms",
        "Transformers",
        "Prompt Engineering"
      ],
      "professionalTopics": [
        "teamwork",
        "code review",
        "communication"
      ],
      "tools": [
        "Arduino",
        "GitHub",
        "Tensoflow",
        "Keras",
        "Python",
        "Google Colab",
        "GPT",
        "Docker",
        "OpenCV",
        "NLTK"
      ],
      "platform": [
        "https://github.com/CMPSC-310-AI-Spring2023"
      ],
      "learningObjectives": [
        "Understand foundational principles that drive the field of artificial intelligence",
        "Practice implementing intelligent applications",
        "Investigate social problems around AI including ethical concerns and environmental challenges",
        "Learn how to determine when an AI approach is appropriate for a given situation, be able to select and implement an AI method for it",
        "Learn to evaluate the developed AI systems while considering their social, political and ethical implications"
      ],
      "learningOutcomes": [
        "Can create a simple agent using Arduino board and sensors",
        "Able to apply search algorithm to solve an agent-based problem",
        "Can design, implement and assess an intelligent system for a computer vision application using supervised learning",
        "Can design, implement and assess an intelligent system for a natural language processing application using deep neural networks",
        "Can effectively reflect on ethical, political and social issues surrounding AI"
      ]
    },
    {
      "courseNumber": "CMPSC 304",
      "courseName": "Robotic Agents",
      "Major": [
        "Informatics Major",
        "Computer Science Major"
      ],
      "Minor": [
        "Informatics Minor"
      ],
      "credits": "4",
      "distributionRequirements": [
        "CL",
        "QR"
      ],
      "prerequisites": {
        "anyof": [],
        "allof": [
          "CMPSC 101",
          "CMPSC 102"
        ]
      },
      "unlocks": [],
      "courseDescription": "A study of the design and implementation of autonomous software agents and robotic systems that cooperatively complete complex tasks. In addition to examining techniques for large-scale coordination and group-based decision-making, students learn how to apply the field's technologies to address the challenges facing local and global communities. Participating in hands-on activities that often require teamwork, students develop and evaluate several multi-agent or multi-robot systems, while also reflecting on the civic issues surrounding the use of these systems. During a weekly laboratory session students use state-of-the-art technology to complete projects, reporting on their results through both written documents and oral presentations. Students are invited to use their own departmentally approved laptop in this course; a limited number of laptops are available for use during class and lab sessions.",
      "cslevel": "Elective",
      "dslevel": "",
      "dsSub": "",
      "inflevel": "Module",
      "infSub": "",
      "selevel": "",
      "technicalTopics": [
        "Ethical Robots",
        "Actuating",
        "Sensing",
        "Locomotion",
        "Modularity",
        "Navigation",
        "Robot Operating System",
        "Manipulation",
        "Mapping",
        "Learning in robotics"
      ],
      "professionalTopics": [
        "community engagement",
        "teamwork",
        "code review",
        "communication"
      ],
      "tools": [
        "Python",
        "ROS",
        "Arduino",
        "Raspberri Pi",
        "Sensors",
        "Drones",
        "GoPiGo",
        "Turtlebot",
        "Git",
        "GitHub"
      ],
      "platform": [
        "https://learnroboticagents.com"
      ],
      "learningObjectives": [
        "Understand the field of agent-based and robotic systems",
        "Gain exposure to multiple different robot platforms",
        "Design and develop several robot applications",
        "Learn about and reflect on public problems that involve robotic technology",
        "Participate in civic engagement activities"
      ],
      "learningOutcomes": [
        "Able to design, implement, and test application for a wheeled robot",
        "Able to design, implement, and test application for a drone",
        "Able to design, implement, and test application for a robotic arm",
        "Can develop a simple application using ROS",
        "Can put together engaging demonstrations using robots for public events"
      ]
    }
  ]
}